export const noodleFlavors = [
  "ซัมยัง ฮ็อตชิคเก้น",
  "ซัมยัง คาโบนาร่า",
  "ซัมยัง ชีส",
  "ซัมยัง ควอทโทรชีส",
  "ซัมยัง ครีมคาโบนาร่า",
  "ซัมยัง โร่เซ่",
  "ซัมยัง สไปซี่ราเมง X2",
  "ซัมยัง หม่าล่า",
];

export const toppings = [
  "ไส้กรอก",
  "ไส้กรอกชีส",
  "ปูอัด",
  "ยำสาหร่าย",
  "ไข่ออนเซ็น",
  "ชีสแผ่น",
  "ไข่กุ้ง",
];

export const extraToppings = [
  { name: "ไส้กรอก", price: 15 },
  { name: "ไส้กรอกชีส", price: 15 },
  { name: "ปูอัด", price: 15 },
  { name: "ยำสาหร่าย", price: 15 },
  { name: "ไข่ออนเซ็น", price: 20 },
  { name: "ชีสแผ่น", price: 20 },
  { name: "ไข่กุ้ง", price: 20 },
];

export const sauceOptions = [
  "ปกติ (เต็มซอง)",
  "กลาง (ครึ่งซอง)",
  "แยกซอสพริก",
];

export const softDrinks = [
  "โค้กถัง",
  "สไปรท์ถัง",
];

export const italianSodaOptions = [
  "บลูฮาวาย",
  "สตรอว์เบอร์รี่โซดา",
  "องุ่นโซดา",
  "น้ำผึ้งมะนาวโซดา",
  "แอปเปิ้ลเขียวโซดา",
];

export const sweetnessOptions = [
  "หวานมาก",
  "หวานปกติ",
  "หวานน้อย",
];